export default `


整体上山大的宿舍分为文瀛与令德两部分

在文瀛一斋至文瀛十二斋里面生活着的大多是研究生。

这些宿舍又被人们称为小红楼，他们具有时代感的外观正是山西大学悠久历史的见证。

 

文瀛十三斋

文瀛十三斋到十五斋基本在学校的中心区域，地理位置优越。其中文瀛十三斋是经济与管理学院的宿舍楼，男女混住，内部多为八床位，但基本安排为六人间，上下铺，同为“三无宿舍”，11点断电。

 

文瀛十四斋

文瀛十四斋是哲学社会学学院的根据地，拥有所有文瀛宿舍区最好的环境条件，虽然同样“三无”，却是四人间并且是上床下桌的宿舍，令其他文瀛人很是羡慕。男女混住，不断电。

 

文瀛十五斋

文瀛十五斋由外国语学院的同学们居住，是六人间、上下铺的“三无宿舍”，男女混住，不断电。

文瀛十二斋B

文瀛十二斋B座是部分文学院以及新闻学院学生的栖息地，男女混住楼，两个学院都有一些女生在其他宿舍生活。六人间、上下铺、无独卫无浴室无阳台，简称“三无宿舍”，晚上12点断电熄灯。

 文瀛区洁美苑

洁美苑在文瀛十二斋B座往南50米左右的位置，较为显眼，一二层是澡堂，女生浴室在左边，男生浴室在右边。

令德一斋——经济与管理学院  

令德二斋——环境与资源学院  

 令德三斋——经济与管理学院  

 令德四斋——数学科学学院   
 
 令德五斋——美术学院   
 
 令德六斋——教育科学学院  

 令德七斋——生命科学学院  

 令德八斋——化学化工学院  

 令德九斋——物理电子工程学院  

 令德十斋——政治与公共管理学院  

 令德十一斋——体育学院 

 令德十二斋——文学院 新闻学院 计算机与信息技术学院 环境与资源学院

 令德十四斋——法学院 初民学院  

 令德十五斋——历史文化学院 文学院 

 令德十六斋——音乐学院 

令德十四、十五、十六斋六人间、上床下桌，无独卫有公共浴室有阳台，瓷砖地板。
宿舍内含两张上下铺的床和两张上床下桌的床，一张桌子三人份。`