<template>
    <div id="LifeInsideSXU">
        <div id="mostTop">

        </div>
        <!-- 住在山大 -->
        <div id="LivingInSXU">
            <div v-html="showText01" class="text" id="LivingInSXU-text"> </div>
            <div class="img" id="LivingInSXU-img"></div>
        </div>
        <!-- 吃在山大 -->
        <div id="EatInSXU">
            <div v-html="showText02" class="text" id="EatInSXU-text"></div>
            <div class="img" id="EatInSXU-img"></div>
        </div>
        <!-- 学生组织 -->
        <div id="Organization">
            <!-- <div v-html="showText03" class="text" id="Organization-text"></div> -->
            <div class="text" id="Organization-text">
                <h1>山西大学学生会</h1>
                <p>山西大学学生会于1919年5月6日成立，是山西大学青年学生的自治组织，是中华全国学生联合会副主席团体单位、山西省学生联合会主席团体单位。在校党委的正确领导与校团委的具体指导下，在全校同学的大力支持下，搭建起学校联系学生的桥梁和纽带。山西大学学生会按照《中华全国学生联合会章程》、《山西省学生联合会章程》和《山西大学学生会章程》的规定，秉承“全心全意为同学服务”的宗旨，倡导和组织同学们“服务学生、锻炼队伍、成长成才”，致力于将学生会建设成为“同学之家、师生之桥、精英之校”。</p>
                <p>山西大学学生会深入学习贯彻习近平新时代中国特色社会主义思想和党的十九大精神、团的十八大精神，始终秉承“全心全意为同学服务”的工作宗旨，践行“服务学生、锻炼队伍、成长成才”的目标任务，落实“十成战略”“四为模式”的工作思路，努力达成“成体系、巧创新、出成绩”和“四个确保”的工作要求。贯彻服务宗旨，深化服务意识，紧抓服务作风，明确服务方向。协调继承纪念与改革创新，统筹内强能力和外塑形象，结合肃风正气同服务维权。弘扬百年精神，立足学校发展，加强能力锻造，着力组织提升。努力把山西大学学生会建设成为令学生向往、受社会关注、被各界认可的培养高素质青年精英领袖的学生组织，奋力谱写山西大学学生会的百年新篇章。</p>
                <p>校学生会内部由主席团和各职能部门组成，主席团下设十部一处一中心，即秘书处、组织部、宣传部、安监部、学术部、文体部、实践部、志工部、女生部、生活部、科创部、渊智传媒中心。其中，学术部下设学生期刊联合理事会，志工部下设山西大学青年志愿者协会，女生部下设“卓尔”礼仪团，生活部下设学生饮食监督委员会，渊智传媒中心下设山西大学青年新媒体中心。各职能部门是学生会的执行部门，对主席团负责，共同构成完整、高效的学生会内部运行机制。</p>
                <p>在全团改革的大背景下，山西大学学生会根据全国学联关于《学联学生会组织改革方案》的相关要求，结合我校团学工作的实际情况，以院系学生会和相关学生组织为外围延伸手臂，指导协助两校区27个院系学生会自主开展工作，在引领青年学生思想，繁荣校园文化，开展志愿服务，推动科技创新创业等方面发挥着重要作用，赢得了全校师生的高度认可和广泛赞誉。</p>
                <h1>山西大学学生社团联合会</h1>
                <p>山西大学学生社团联合会前身为成立于2002年10月的山西大学学生生社团理事会，2008年9月更为现名，简称“社联”。现下设秘书处、组织部、监管部、活动部、公关部、财务部、权益部、学习部、社团发展研究中心、启明传媒中心十个部门。</p>
                <p>目前，全校共有学生社团110家，其中坞城校区66家，大东关校区公益实践六大类别，社联对社团的发展起着至关重要的作用，是丰富校园文化生活、应接校内外学生社团活动的主要组织者与参与者，是学校纷繁精彩的学生社团的管理者。</p>
                <h1>山西大学图书馆学生管理委员会</h1>
                <img src="../assets/picture/学生组织/5d0576dcb34e044134.jpg">
                <img src="../assets/picture/学生组织/5d057722a958267202.jpg">
                <p>年，山西大学图书馆内，本着协助图书馆工作的目的，义务馆员协会第一次成立。从那时起，山西大学图书馆义务馆员协会由幼及长，一步步发展，壮大。这个自发性、义务性的组织，以自己的热情与坚持，协助工作人员，服务学生读者。</p>
                <p>随着义务馆员协会的逐渐成熟，人员的不断增加，馆内领导对义务馆员工作水平要求的提高，义务馆员协会的转变既是思考良久也是迫在眉睫。</p>
                <p>自2015年始，协会相关负责人员开始为将义务馆员协会申请为校级组织积极筹划，完善各项制度，准备各项材料。</p>
                <p>随着义务馆员协会组织结构逐渐完备，管理愈发正规化、标准化。协会全体成员都明白，转变即将到来，我们要做的，是更好地专注于管理与服务。</p>
                <p>2016年5月20日，在经过不懈努力，山西大学图书馆义务馆员协会正式成为校级组织，更名为图书馆学生管理委员会（以下简称图管会）。图管会是接受校团委领导，在图书馆指导下的进行自我提升，为学生读者提供服务的群众性学生组织。</p>
                <p>如今，图管会在主席团的领导下，共有七个分管部门。他们分别是：流通部、实践部、秘书处、组织人事部、宣传部、礼仪部、编辑部。</p>
                <p>时光荏苒，白驹过隙，如今，第一批、第二批、第三批义务馆员多已退出。同时，一批有一批新人又加入进来。人在变，但服务读者，自我管理的宗旨却从未改变。“竹影摇书案上，野泉声入砚池中”，如此韶光，图管会全体成员总会伴读者之侧。</p>
                <p>又是一年入学之际，图管会期待更多的新面孔加入这个崭新的组织，期待与每一个你共同成长！</p>
                <h1>山大报社</h1>
                <img src="../assets/picture/学生组织/5d0577721f41060414.jpg">
                <img src="../assets/picture/学生组织/5d0577ce28a3b40868.jpg">
                <p>籍贯：山西太原</p>
                <p>年龄：76岁</p>
                <p>家庭人数：200余人</p>
                <p>家庭机构：主席团、融媒体中心、采编中心、视觉中心、常务中心</p>
                <p>家长：石海红（山西大学党委宣传部副部长）、祁华（山西大学党委宣传部老师）、张颖（山西大学党委宣传部老师）</p>
                <p>主要工作：记录山大历史、传播山大文化、引导山大舆论，争做山大最一流的综合性校园媒体</p>
                <p>主要平台：山西大学报（连续多年荣获山西省一级报纸）、山西大学报社微信公众号（清博指数影响力排名，多次名列全国、全省、山大第一）、山西大学新闻网、山西大学报社官方QQ、微博等</p>
                <p>为顺应媒体发展潮流，推动报社组织机构和文化建设，山西大学报社进行了一系列的变革，现形成“四中心八部门”的基本组织架构。    山西大学报社下设常务中心，分有文化部、外联部、活动部；  采编中心，分有特稿部、评论部、文艺副刊部；  融媒体中心，分为日常运营小组和H5工作室；  视觉中心，分为拍摄组、后期组、直播组、手绘组。  形成中心—部门—小组的基本组织架构，各中心、部门、小组既相互独立又和谐统一，共同完成报社的采访编辑、报纸发行、文化传承、活动组织、网络宣传等各项工作，为报社的正常运转起到极为重要的作用。  为加强山西大学报社的文化建设工作，努力营造“家文化”的氛围。组织机构上，设立文化部，进行校报的文化建设工作；对外文化形象展示上，自主设计山西大学报社吉祥物“豹豹”，并制作成实物模型，参与校报各种大型活动的宣传工作；制作“山西大学报社宣传片”，对外传播良好形象；修订《山西大学报社规章制度汇编》，与时俱进，让各项工作有制度可依；自主改编山西大学报社社歌，努力营造文化氛围；自主设计山西大学报社社服，对外展示统一形象；组织春季出游活动，增强报社内部各部门成员间的感情。</p>
                <h1>山大青年</h1>
                <img src="../assets/picture/学生组织/5d0578704529857167.jpg">
                <p>山西大学《山大青年》杂志社隶属于共青团山西大学委员会，是在校党委领导和校团委指导下的校级学生组织，也是我校团委工作的重要宣传机构，是山西大学团学工作的重要窗口。</p>
                <p>杂志社创刊于1983年，始终本着“高擎青春火炬，勇为时代先声”的办刊宗旨。自创办以来，累计发行39期纸质杂志、6期电子期刊，面向全校甚至全省市发行，发行覆盖面达20000人左右，其优秀文章多次受到山西青年报、中青网等多家媒体报道和转载。除此之外，举办“习语金句·百校千言——当代书法名家进高校翰墨巡展”，“渊智论坛系列活动”，“五四主题征文”等大型活动，受到广泛好评。杂志社成员将依托纸质杂志、微信平台、QQ空间、新浪微博等平台，同心协力、一如既往地做好各项工作，做好山大青年，传播山大声音。</p>
                <h1>山西大学电视台</h1>
                <p>​山西大学电视台成立于2012年10月，隶属于山西大学校党委宣传部。作为一个新兴的校园媒体组织，山西大学电视台旨在丰富校园文化活动，促进校园文化事业的发展，是山西大学的重要宣传部门之一。</p>
                ​<p>山西大学电视台是一个肩负学校电视新闻报道，校园影视节目制作、播放及对外电视新闻、视频交流等任务的机构。下设常务中心、制作中心和新媒体中心三大中心。</p>
                ​<p>节目主要包括新闻节目（校园新闻、快新闻以及国际新闻），光影节目《光影时间》，脱口秀节目《山大Talk Show》</p>
                <h1>君宇网通讯社</h1>
                <p>山西大学君宇网学生通讯社是山西大学党委学生工作部（处）指导下的大学生思想政治教育主题校园媒体，由学生工作部（处）指导老师和来自各个院系的近百名学生组成。分为四大中心：常务中心、视觉中心、采编中心与新媒体中心，每个中心下设两个部门。君宇网四个中心八个部门相互沟通协作，举办了一系列特色活动，如21天晨跑活动、校庆卷轴活动、线上朗读者活动、FM1902、山大快问和漫话山大等。君宇网立志于推送最新最全最广的校园新闻与资讯，以学校内外广大师生为服务对象，竭力打造一个能实现便利服务与交流互动的校园网络服务平台，打造山西大学特色的校园网络文化。</p>
            </div>
            <div class="img" id="Organization-img"></div>
        </div>
        <!-- 多彩社团 -->
        <div id="Association">
            <!-- <div v-html="showText04" class="text" id="Association-text"></div> -->
            <div class="text" id="Association-text">
                <h1>开源软件协会</h1>
                <img src="../assets/picture/多彩社团/5d0579650084c42041.jpg">
                <P>山西大学开源软件协会成立于2018年。社团是一个通过开源软件许可证协议后，公布软件源代码的网络平台。社区中的开放源码软件主要由散布在全世界的编程者所开发，开源社区成为他们沟通交流的网上平台。社团中成员曾参赛荣获2019ASC世界大学生超级计算机竞赛获得全球总决赛一等奖，蓝桥杯山西省一等奖等奖项。</P>
                <P>协会秉承“服务全校师生，锻炼自身能力”的宗旨，广泛汇集学校编程爱好者，为本校广大编程爱好者提供一个融洽而持久的交流技术、增进友谊的平台。</P>
                <P>协会每周会定期开展技术沙龙活动，普及有关计算机，编程有关的开源文化知识，也会定期开展竞赛等活动，丰富了课余时间，也锻炼了社团成员动手能力。</P>
                <P>协会的目的为参加一些全国计算机建模或计算机竞赛和其它同类性质的比赛。山西大学开源软件协会是一个以推动开源精神的传播为目的，以参与开源项目的学习与贡献为手段的一个集咨询、服务、锻炼为一体的学生开源社区。力求成为山西大学内最大的Geek社团。聚集更多的Geek与Hacker。为Geek和Hacker们提供一个交流学习技术的平台！</P>
                <h1>山西大学自行车协会</h1>
                <img src="../assets/picture/多彩社团/5d057a0ad87d546153.jpg">
                <img src="../assets/picture/多彩社团/5d057a4b9d8e162496.jpg">
                <p>山西大学自行车协会，英文名CASU。社团成立于1998年11月18日，是山西大学成立最早的一批社团之一。自行车协会是在校团委领导下，由热爱自行车运动，勇于挑战自我，深入社会的在校大学生自发组织，自愿参加的学生社团。</p>
                <p>宗旨:挑战自我，超越梦想。</p>
                <p>目标:团结、奋斗、锻炼、进步。</p>
                <p>方法:科学考察、旅行探险、参观游历、参加社会公益活动等各种社会实践与锻炼活动。</p>
                <p>获奖:2005年获得全国十佳社团，是山西省内唯一获得此殊荣的社团，连续17年获得校十佳社团。</p>
                <p>活动:1.义务修车点2.晚训3.车协小课堂4.平时活动5.寒暑假远征:太原——洛阳、西安——敦煌、太原——厦门、太原——延安……20多次的远征，车协人的足迹已经走遍了全国各地。</p>
                <h1>Du百科俱乐部</h1>
                <img src="../assets/picture/多彩社团/5d057ace2116f26586.jpg">
                <p>山西大学Du百科俱乐部，是百度公司支持的以共同编纂百度百科和互联网产品创新为核心的知识型、学术型高校学生组织。本社团接受山西大学哲学社会学学院团委的领导，山西大学学生社团联合会的监督，由山西大学热爱百科知识和公益事业的在校学生共同建立，由百度公司授权的非盈利性学生公益组织。具体活动分为线上和线下两种。线上活动包括词条编辑、创新互动、公益百科，其主要为了扩大山西大学的影响。线下活动包括公益事业、就业机会、社会实践，其主要为了给成员普及公益知识，参与百度公司所组织的活动，提供面向百度等大公司的实习机会。</p>
                <h1>山西大学红枫志愿者协会</h1>
                <img src="../assets/picture/多彩社团/5d057b5c2647f68649.jpg">
                <p>山西大学红枫志愿者协会成立于1999年，是山西大学历史最为悠久也是最大的公益类社团之一。20年来协会本着“立足校园，净化心灵，面向社会，传递真情”的原则，积极投身于各种形式的校内外志愿者服务与教育活动，并在2013年，2014年，2016—2017年均获得“十佳社团”的表彰，并在山西大学2017年度社团考核中取得第一名的好成绩。</p>
                <p>十多年来，红枫志愿者协会一直秉承最初的信念，成功举办了多次志愿活动。包括“善行100”暖冬行动，“我是你的眼”关爱盲童活动等。</p>
                <p>红枫志愿者协会是一个历史悠久，规模庞大的公益类社团，全体社员更是公益路上的行者。红枫永不凋零，红枫永守公益，红枫与你同行。</p>
                <h1>山西大学健美操协会</h1>
                <img src="../assets/picture/多彩社团/5d057c00d1fab55449.jpg">
                <p>山西大学健美操协会成立于2012年，原名艺彤健美操协会，于2015年正式更名为山西大学健美操协会。是山西大学颇具影响力的体育类社团，拥有“山西大学2017年最具人气社团”“山西大学十佳社团”等诸多荣誉称号，并常年受山西省健美健美操协会的指导和帮助。</p>
                <p>社团以“健美、健身、健心，丰富学生日常业余活动“为宗旨，广泛汇集学校健美操爱好者，在全校范围内促进健美操运动的开展，为本校广大健美操爱好者提供一个融洽而持久的交流技术、增进友谊的平台。</p>
                <p>协会成立五年多来，自我不断发展、创新，并且拥有了自己每周练习的固定场地，其教练均来自健美操专项学生，主要学习街舞、爵士、HipHop、urban、健身操、有氧舞蹈等，广受山大学子的热爱和欢迎。除常规授课外，会经常带领社员参加各种比赛、演出、晚会表演等活动，锻炼提高自己，不断丰富自我的校园文化生活。</p>
                <h1>教育知行社</h1>
                <img src="../assets/picture/多彩社团/5d057c3395eec12977.jpg">
                <p>2007年9月25日，山西大学教育知行社成立，它由任桂平博士担任指导老师，是山西大学教育科学学院支持下成立的一家公益与社会实践相结合的学生社团组织。十二年来我们坚守着公益理念，秉承着“知行合一，教育先行”的宗旨，坚持不懈的对基础教育落后地区开展公益支教。长期开展类型多样的教育公益实践活动。此外，社团在每年五月进行暑期支教招募活动，于七月至八月在乡村进行暑期支教活动，为乡村教育添砖加瓦。社团足迹遍布三晋大地多个角落，活动先后被全国多家媒体报道。在社团考核评比中，连续多次获得“校园十佳社团”、“优秀团支部”等奖项，被评选为山西大学暑期“三下乡”优秀社会实践服务队，荣获“全国高校十佳品牌社团”等荣誉。</p>
                <h1>轮滑社</h1>
                <img src="../assets/picture/多彩社团/5d057ccecd31133170.jpg">
                <p>山西大学轮滑社自2016年成立到如今已经四年了，虽然成立较晚，但是在历任社长的带领下，在所有管理层和社员的努力下，山西大学轮滑社在这四年里欣欣向荣，取得了许多好成绩。 轮滑社设秘书处，宣传部，组织部，三者分工协作使社团活动能顺利举办。社团宗旨“扬轮滑精神，筑健康体魄，用脚步丈量远方，用热血浇灌青春”被每个社员牢记心中。</p>
                <p>每年的九月，山西大学轮滑社迎来新鲜血液，随后会展开一系列精彩活动：</p>
                <p>老社员细心向新成员教授轮滑技巧和动作</p>
                <p>南操新生赛——检验动作学习成果</p>
                <p>相约刷街——遇见汾河优美夜色</p>
                <p>万圣节——带鬼面送给路人甜甜糖果</p>
                <p>周末假期——与其他院校进行交流学习</p>
                <p>冬日滑雪——冷风中收获暖暖笑容</p>
                <p>平安夜——发苹果像家人一样互相祝福</p>
                <p>嘉年华——技术与速度带来满满的成就感</p>
                <p>五一烧烤——自己烤的食物味道更加香浓美好</p>
                <p>讲出来的故事永远不如经历过体会更深，说出来的美好也不如经历过感受强烈。山西大学轮滑社是一个温暖的大家庭，在这里你会收获帅气的轮滑技术，在这里你会收获互相陪伴一起玩耍的幸福，相信山西大学轮滑社一定会越来越好。</p>
                <h1>演讲与口才协会</h1>
                <img src="../assets/picture/多彩社团/5d057d9492fad82081.jpg">
                <p>山西大学演讲与口才协会简称“口协”，英文名称是Speech And Eloquence Association. 协会是服从于共青团山西大学委员会的领导及学生社团联合会的管理，在山西大学文学院直接指导下，由在校大学生自发组织、参加的学术型社团。协会把”来源于同学，服务于同学”作为指导思想，以“纵横驰骋，舌战群雄；辩古今中外，论难圆之理”为口号，本着“锻炼口才、明晰思辨、提高素质、展现自我”的宗旨，通过举办各种活动来丰富校园第二课堂。</p>
                <h1>音乐爱好者协会</h1>
                <p>标语：为音乐而梦想，为梦想而前行</p>
                 <img src="../assets/picture/多彩社团/5d057e03b81f897579.jpg">
                <p>简介：音乐爱好者协会隶属山西大学音乐学院，并下设宣传部、活动部与外联部，目前社员人数为100人。本社团已曾本学年参与社联女生节表演区域活动，成功举办11月23日音协路演活动、4月1日歌舞青春街舞社音协联合路演活动等。</p>
                <p>为丰富同学们的课余生活，我们致力于为同学们提供广阔音乐交流平台以展示自我、发展自我、提升自我的音乐社团，如果你爱好音乐，爱好唱歌，请加入我们，我们与你同行！</p>
                <p>日常活动：两周一次的音乐知识学习；各类文艺演出；不定期的KTV嗨唱……</p>
                <h1>英语沙龙学社</h1>
                <img src="../assets/picture/多彩社团/5d057f18214c948457.jpg">
                <p>想感受纯粹的英语母语环境吗?</p>
                <p>想体验和外教面对面交谈的快感吗?</p>
                <p>想了解原汁原味的美国文化吗?</p>
                <p>赶快加入我们一一英语沙龙学社!</p>
                <p>英语沙龙学社( English Salon)是隶属于山西大学外国语学院的专业社团，以“创造英语母语学习环境、提高英语学习成绩、打造英语口语水平”为宗旨。我们将与你共同分享英语学习的快乐与收获，展示你未曾发掘的的潜力与魅力，給你带领不同凡响的英语激情!</p>
                <p>趣味活动：</p>
                <p>每周一部英语原声电影，并赠送电影赏析学习资料，周周视听大挑战，让你不提高听力口语水平都难!</p>
                <p>每周英语角，让外教与你面对面交流，感受纯正外文发音，让你开口说英语不再困难！</p>
                <p>定期举办主校性英语学习讲座，邀请外院专业教师，让你四六级不发愁，对英美国家留学信息了如指掌!</p>
                <p>每学期的晨读活动，专业学姐学长领读，免费提供四六级读物。</p>
                <p>还有盛大的圣诞晚会、万圣节狂欢夜、英语歌曲大赛，和外院学姐学长学小语种，法语、日语、俄语、德语一网打尽!</p>
                <p>每个活动都有奖品！</p>
                <h1>羽林汉学学社</h1>
                <img src="../assets/picture/多彩社团/5d057f91cddec54026.jpg">
                <p>山西大学羽林汉学社成立于2014年10月，成立时间将近5年，社团人数多达400余人。羽林，即“为国羽翼，如林之盛”。羽林汉学社 旨在通过中国传统服饰——汉服来宣传复兴汉文化。我们坚持“始于衣冠，达于博远”，重拾五常六艺，学习并弘扬中国传统文化礼仪。</p>
                <p>山西大学羽林汉学社面向全体热爱汉服的同学，为广大汉服爱好者和传统文化爱好者提供一个交流的平台。</p>
                <p>社团宗旨：着我汉家衣裳，兴我礼仪之邦。</p>
                <p>小组介绍：汉舞组，音乐组，手工组，衣礼组，射艺组!</p>
                <h1>山西大学天文协会</h1>
                <img src="../assets/picture/多彩社团/5d05e6f8e179468070.jpg">
                <img src="../assets/picture/多彩社团/5d05e6f93dcbf34970.jpg">
                <p>山西大学天文协会成立于1998年10月25日，是山西省成立最早的天文高校社团。</p>
                <p>山西大学天文协会是一个以科学普及为己任的学生社团，协会成立之初，原中国天文学会理事长、天文学家李启斌先生为山西大学天文协会的会刊题写了刊名。秉承着科普求知的社团精神，20年来，时光荏苒，天文协会在时间的打磨下日渐成长，如今已发展为山西大学最知名的社团之一。</p>
                <p>目前，协会拥有6台各口径天文望远镜以及大量电子及纸质资料和部分陨石收藏品，并设有大东关校区天文分社。除日常观星活动外，协会还打造了双子座流星雨（曾获央视报道）、中秋节狂欢夜（荣获探月与航天工程褒奖）等诸多品牌活动。</p>
            </div>
            <div class="img" id="Association-img"></div>
        </div>
        <!-- 大型活动 -->
        <div id="Activity">
            <!-- <div v-html="showText05" class="text" id="Activity-text"></div> -->
            <div class="text" id="Activity-text">
                <h1>“山大之声”诗文朗诵大赛</h1>
                <img src="../assets/picture/大型活动/5d058046729bf59468.jpg">
                <p>时代洪音，声传山大。由山西大学主办，山西大学文学院承办的“山大之声”诗文朗诵大赛于每年春季举办，为丰富我校学生的校园文化生活，营造浓厚的语言文化氛围，用中华优秀文化教育、启发与激励大学生以正确的态度继承和弘扬传统文化，提升学生的人文素养与人文情怀。每年，来自于各个学院、各个国家的朗诵爱好者汇聚一堂，共同切磋，他们用动听的声音展示作为山大人的自信，用充沛的感情抒发对中国的热爱与骄傲！</p>
                <p>“山大之声”诗文朗诵大赛每年都会邀请专业的老师担任评委，为同学们指导并提出宝贵意见，帮助同学们更好的理解诗文篇目，提高朗诵水平，得到全方位的进步。</p>
                <p>“山大之声”诗文朗诵大赛至今已成功举办两届，本活动对增强同学们的文化自信及增进校园的文化氛围具有积极作用。未来，我们希望收到各位的宝贵意见不断提升活动水平，我们更诚邀与期待各位诗文朗诵爱好者的踊跃参与！</p>
                <h1>人文知识竞赛</h1>
                <img src="../assets/picture/大型活动/5d05801133dbe45189.jpg">
                <p>（1）山西大学人文知识竞赛</p>
                <p>“观乎人文，以化成天下。” 为弘扬中华优秀传统文化，营造浓郁的校园文化艺术氛围，增强学生的文化自觉意识和创新精神，为学生的成长、成才奠定宽厚的人文知识基础，提升山大学生的人文知识修养，树立起高度的文化自觉与文化自信，由山西大学主办，山西大学文学院承办的山西大学人文知识竞赛已连续成功举办八年。每年秋季都会有数百位人文知识爱好者参加初赛，少数优胜者进入决赛，以小组的形式经古诗创作、现场答题、经史策问及人文演绎等四个环节的比拼后赛出最后胜利的队伍。在这里我们可以看到思想的碰撞、语言的辩驳、知识的融汇，这不仅仅是一场比赛，更是人文知识爱好者的舞台，是中华文化荟萃与激昂的殿堂！</p>
                <p>（2）山西省人文知识竞赛</p>
                <p>为贯彻落实国家、省中长期教育改革和发展规划刚要精神，吸引、鼓励广大学生增强学习人文知识、阅读人文经典的兴趣与积极性，提高大学生的文化素养，培养学生的文化自觉意识与创新精神，由山西省主办，山西大学承办，并由山西大学文学院负责的山西省人文知识竞赛已成功举办七次。由山西省内各高校组成的各自的代表队汇聚一堂，在山西大学呈现一场知识的较量。大赛由古诗创作、现场答题、经史策问及人文演绎等四个环节组成，在赛场上来自山西各高校优秀的代表队成员“指点江山，激扬文字”，全方位，多层次的展现了当代大学生的人文素养以及中华文化的博大精深，为传承和弘扬中国优秀传统文化献出一份力。</p>
                <p>这不仅仅是一场比赛，更是传播人文知识的舞台，在未来，我们会倾尽全力将比赛传承下去，让人文知识更广泛的向社会传播，我们诚邀与期待欢迎各位同学的加入！</p>
                <h1>“记录者”活动</h1>
                <img src="../assets/picture/大型活动/5d0580d13f73344676.jpg">
                <p>新闻学院“记录者”活动每年围绕国家重大主题开展，结合新闻传播学特色，引导学生紧跟时代步伐、培养家国情怀、深入了解社会、增强实践能力。</p>
                <p>目前，学院已成功举办两届活动，分别以“喜迎十九大，看家乡新变化”和“改革开放四十年，家乡旧色焕新颜”为主题，400余名同学参与，收到文字、文案策划、摄影、视频等作品1500余件。同学们用笔和镜头,记录了祖国日新月异的变化，展现了家乡各具特色的风土人情、深厚悠久的文化底蕴、昂扬向上的精神风貌和团结奋进的生动实践。</p>
                <p>大赛获奖作品在学校各类媒体进行了展出和报道。优秀作品在全省各大传媒平台进行了展示和报道。</p>
                <p>新闻学院“记录者”活动将继续推出关注年度国家大事的主题大赛，弘扬社会主义核心价值观和中华优秀传统文化，倡导学生自觉承担起举旗帜、聚民心、育新人、兴文化、展形象的使命任务，努力发掘和培养讲好中国故事、传播好中国声音的优秀新闻传播人才。</p>
                <h1>风筝节</h1>
                <img src="../assets/picture/大型活动/5d058126441e454253.jpg">
                <p>“草长莺飞二月天，拂堤杨柳醉春烟。儿散学后归来早，忙趁东风放纸鸢”。春暖花开放风筝自古便是民间的传统。在这柳丝成绦，丁香暗语，蝶影翩翩的时节，为了让同学们重拾童年欢趣，缓解学习压力，实现劳逸结合，放松大家的心情，放飞风筝，放飞梦想！山西大学物理电子工程学院团委学生会特主办“筝奇斗艳”风筝节活动，在此活动中，我们会开展制作风筝的培训会，然后同学们和队员们可以根据所学到的知识亲手制作属于自己的风筝，发挥自己无限的想象力，做出既漂亮与可以飞的很高的风筝，随后还可以与其他队伍进行放风筝比赛，在竞争中享受乐趣，当然还有丰富的奖品可以得到哦。</p>
                <h1>《一战到底》宣传</h1>
                <img src="../assets/picture/大型活动/5d0581ad2e53782518.jpg">
                <p>眼观六路，耳听八方，最丰富的知识储备，最开阔的中外视野，想挑战自己的上限吗？山西大学初民学院大型知识竞赛类活动“一战到底”了解一下！也许你并不是什么第一名，也许你怀才不遇，也许没有突出的特长，但每个人都有无限的想法和潜能，只要敢于挑战，就有胜利的希望！音乐、影视、综艺、体育、文学、数理、逻辑……知识从来不是可量化的东西，装在自己脑子里和心里的东西无人能够夺取，来“一战到底”的舞台，给你一个展现力量的机会！</p>
                <h1>山大好声音</h1>
                
                <p>为了贯彻落实习近平总书记在全国高校思想政治工作会议上的讲话精神，全力推进我校思想政治工作，每隔两年山西大学音乐学院将会举办精心打造的 “一院一品”——“山大好声音”，为了丰富校园文化，此活动面向全山西大学的每一位在读本科生、研究生。</p>
                <img src="../assets/picture/大型活动/5d05821f2311026898.jpg">
                <p>让青春与青春对话，让歌声与梦想齐飞！报名过后，将会从几百名选手中进行海选、导师盲选、导师考核、巅峰对决等环节在音乐学院音乐厅进行大型展演，选手经过层层选拔，将会脱颖而出最后的冠军、亚军、季军以及优秀学员，他们带着美妙的歌声，燃烧的激情，澎湃的梦想，年轻的风采，唱响青春，唱响最后的“巅峰之夜”！</p>
                <p>此活动参与人数之多，关注度之大，震撼力之强，影响力之深远，每次举办过后都将被全校师生称作“山大最好的活动”。</p>
                <h1>“电脑文化月”</h1>
                <img src="../assets/picture/大型活动/5d0582973d3c286795.jpg">
                <p>“电脑文化月”活动旨在提高我校学生的算法设计能力和创新创业能力，为广大学子提供展示自己的平台。活动举办于每年的4、5月，至2019年已成功举办十届。</p>
                <p>活动形式包括诸如：宣传活动的“晒机”活动、互联网前沿相关讲座；以及，算法竞赛、软件设计大赛、视频制作大赛、平面设计大赛等的各项比赛。为全校学子提供充实自我的机会、表现自我的舞台。在为期一个月的电脑文化月中，我们鼓励并支持同学们积极参与比赛，这对于同学们学习专业知识有着促进作用，让计算机爱好者有自信去展示自己的才能。这项活动不仅让同学们发现身上的优点，更使同学们发掘自身潜能，为学院，为山大贡献自己的一份力量。</p>
                <h1>史无前"历"</h1>
                <p>“史无前历”是历史文化学院一个以话剧形式展开的面向全校的特色活动，它专注于历史并通过历史题材的话剧方式将大众从另一个角度带进历史、了解历史。为了弘扬中国传统文化，光大话剧艺术。截至今日，历史文化学院已举办了多场话剧。</p>
                <p>第一场《黎明之前》是为纪念抗战胜利70周年，故事发生在一个战火纷飞的时代，各种情感交错，编奏爱国的进行曲。第二场《太阿倒持》带我们梦回唐朝，看安史之乱之下唐王朝的权力游戏。第三场历史文化学院原创校史话剧《山大·山大》，抒发对母校的深厚情感。第四场《年华》让我们重返昔日，去感受恢复高考，感受下海经商，感受老一辈人的梦想与追逐。以及广受好评的话剧《山大·山大》在去年再次隆重上演。</p>
                <h1>全明星篮球赛</h1>
                <img src="../assets/picture/大型活动/5d05833a2395b88423.jpg">
                <p>盛夏已至，山西大学第十二届校园全明星篮球赛将于6月14日在山西大学鴻猷体育场拉开战幕！</p>
                <p>再火热的夏天，也要有一颗百分百热爱篮球的心！参加全明星篮球赛的有CUBA山大男篮球员，还有来自各学院篮球队的明星球员。他们将为我们带来具有山大风格的篮球视觉盛宴。</p>
                <p>本次全明星篮球赛开设有"普院全明星内部赛”，“斗牛比赛”，“三分大赛”，“普院全明星队与CUBA山大男篮常规赛”等赛事。届时，大家也能够欣赏到由健美操社与优秀啦啦操队带来的精彩演出!</p>
                <h1>栋梁杯足球联赛</h1>
                <img src="../assets/picture/大型活动/5d058941b366829785.jpg">
                <p>栋梁杯足球赛是山大最知名的体育赛事之一。</p>
                <p>已经走过三十八个年头的“栋梁杯”，它几乎成了山大体育赛事的代名词。</p>
                <p>如果青春有颜色，大概就是绿茵场的颜色。</p>
                <p>挥洒汗水、拼搏青春，你会在这里感受世界第一大运动的魅力，收获珍贵的友情，为你的青春留下浓墨重彩的一笔！</p>
                <div id="end"></div>
            </div>
            <div class="img" id="Activity-img"></div>
        </div>
        <!-- 便利生活 -->
        <div id="ConvenienceOfLive">
            <div v-html="showText06" class="text" id="ConvenienceOfLive-text"></div>
            <div class="img" id="ConvenienceOfLive-img">
                <button id="toNext" v-on:click="startReading()">
                    <span>
                        校外生活
                    </span>
                    <span>
                        <Icon type="ios-arrow-forward" />
                    </span>
                </button>
            </div>
        </div>
    </div>
</template>

<script>
const markdown = require( "markdown" ).markdown;
import 住在山大 from '../doc/校内生活/住在山大'
import 吃在山大 from '../doc/校内生活/吃在山大'
// import 学生组织 from '../doc/校内生活/学生组织'
// import 多彩社团 from '../doc/校内生活/多彩社团'
// import 大型活动 from '../doc/校内生活/大型活动'
import 便利生活 from '../doc/校内生活/便利生活'
export default {
    data() {
        return {
            showText01: '',
            showText02: '',
            // showText03: '',
            // showText04: '',
            // showText05: '',
            showText06: '',
        }
    },
    beforeMount() {
        this.showText01 = markdown.toHTML(住在山大);
        this.showText02 = markdown.toHTML(吃在山大);
        // this.showText03 = markdown.toHTML(学生组织);
        // this.showText04 = markdown.toHTML(多彩社团);
        // this.showText05 = markdown.toHTML(大型活动);
        this.showText06 = markdown.toHTML(便利生活);
    },
    methods: {
        startReading() {
            this.$router.push("/校外生活");
            document.body.scrollTop = 0;
            document.documentElement.scrollTop = 0;
        },
    }
}
</script>

<style>
    #LifeInsideSXU {
        width: calc(100vw - 70px);
        margin-left: 70px;
        position: absolute;
        top: 0;
    }

    #mostTop{
        height: 68px;
        background-color: #099;
    }

    #LivingInSXU {
        position: relative;
    }

    #EatInSXU{
        position: relative;
    }

    #Organization{
        position: relative;
    }

    #Association{
        position: relative;
    }

    #Activity{
        position: relative;
    }

    #ConvenienceOfLive{
        position: relative;
    }

    #LivingInSXU-text {

    }
    #LivingInSXU-img {
        background-image: url(../assets/过渡/校内生活/ZZSD.png); 
    }

    #EatInSXU-text {

    }

    #EatInSXU-img {
        background-image: url(../assets/过渡/校内生活/CZSD.jpg);         
    }

    #Organization-text{

    }

    #Organization-img{
        background-image: url(../assets/过渡/校内生活/XSZZ.jpg); 
    }

    #Association-text{

    }

    #Association-img{
        background-image: url(../assets/过渡/校内生活/DCST.jpg); 
    }

    #Activity-text{
    }

    #Activity-img{
        background-image: url(../assets/过渡/校内生活/DXHD.jpg); 

    }

    #ConvenienceOfLive-text{

    }

    #ConvenienceOfLive-img{
        background-image: url(../assets/过渡/校内生活/BLSH.jpg); 
    }

    #LivingInSXU::before{
        content: '住在山大';
        position: absolute;
        top:-53px;
        color: #099;
        font-size: 25px;
        width: 140px;
        height: 53px;
        background: #fff;
        border-top-left-radius: 10px;
        border-top-right-radius: 10px;
        text-align: center;
        line-height: 53px;
        right: 10vw;
    }

    #EatInSXU::before{
        content: '吃在山大';
        position: absolute;
        top:-53px;
        color: #099;
        font-size: 25px;
        width: 140px;
        height: 53px;
        background: #fff;
        border-top-left-radius: 10px;
        border-top-right-radius: 10px;
        text-align: center;
        line-height: 53px;
        right: 10vw;
    }

    #Organization::before{
        content: '学生组织';
        position: absolute;
        top:-81px;
        color: #099;
        font-size: 25px;
        width: 140px;
        height: 53px;
        background: #fff;
        border-top-left-radius: 10px;
        border-top-right-radius: 10px;
        text-align: center;
        line-height: 53px;
        right: 10vw;
    }

    #Association::before{
        content: '多彩社团';
        position: absolute;
        top:-81px;
        color: #099;
        font-size: 25px;
        width: 140px;
        height: 53px;
        background: #fff;
        border-top-left-radius: 10px;
        border-top-right-radius: 10px;
        text-align: center;
        line-height: 53px;
        right: 10vw;
    }

    #Activity::before{
        content: '大型活动';
        position: absolute;
        top:-81px;
        color: #099;
        font-size: 25px;
        width: 140px;
        height: 53px;
        background: #fff;
        border-top-left-radius: 10px;
        border-top-right-radius: 10px;
        text-align: center;
        line-height: 53px;
        right: 10vw;
    }

    #ConvenienceOfLive::before{
        content: '便利生活';
        position: absolute;
        top:-53px;
        color: #099;
        font-size: 25px;
        width: 140px;
        height: 53px;
        background: #fff;
        border-top-left-radius: 10px;
        border-top-right-radius: 10px;
        text-align: center;
        line-height: 53px;
        right: 10vw;
    }

    .img {
        height: 700px;
        width: 100%;
        background: url(../assets/home.jpg) fixed no-repeat;
        background-size: calc(100vw - 10px);
        background-position:100% 100%;
    }

    .text {
        width: 92%;
        display: block;
        font-family: Arial, Helvetica, sans-serif;
        font-size: 19px;
        line-height: 30px;
        letter-spacing: 1px;
        margin-top:10px;
        margin-bottom: 10px;
        margin-left: 3%;      
    }

    #toNext{
        width: 208px;
        height: 70px;
        background: rgba(0, 0, 0, 0);
        color: #fff;
        border: #000;
        font-family: Arial, Helvetica, sans-serif;
        font-size: 30px;
        position: absolute;
        right: 60px;
        bottom: 30px;
    }

    #toNext:hover{
        transform: scale(1.1) translateX(20px);
        transition: all .5s;
        cursor: pointer;
        border: #fff solid 2px;
    }

    #Association-text strong:nth-child(9) {
        margin-top: 55px;
    }

    #Organization-text strong:nth-child(1) {
        margin: 0;
    }

    #Association-text strong:nth-child(1) {
        margin: 0;
    }

    #Activity-text strong:nth-child(1) {
        margin: 0;
    }

    #ConvenienceOfLive-text strong:nth-child(1) {
        margin: 0;
    }

    #LifeInsideSXU img{
        float: right;
        height: 200px;
    }

    #end {
        height: 100px;
    }

    p{
        text-indent: 2em;
        line-height: 2em;
    }

    h1 {
        text-indent: 2em;
        margin-top: 2em;
        line-height: 2em;
        font-size: 19px;
    }
</style>