export default `


**大学考证的黄金时期，许多证书可以在未来的考研求职起很大的作用。大家一定要规划好自己的生活，尽可能多地考取对自己有提升作用的证书**


###英语四六级（四级是本科生要求必过的）

笔试每年六月、十二月

口试每年五月、十一月

###专四专八（英语专业学生必考）

专四每年四月、专八每年三月

###雅思托福（出国必备）

###普通话水平测试

普通话水平测试（PSC：PUTONGHUA SHUIPING CESHI）是对应试人运用普通话的规范程度、熟练程度的口语考试。考试形式为口试。普通话水平等级分为三级六等，即一、二、三级，每个级别再分出甲乙两个等次；一级甲等为最高，三级乙等为最低。普通话水平测试不是口才的评定，而是对应试人掌握和运用普通话所达到的规范程度的测查和评定，是应试人的汉语标准语测试。应试人在运用普通话口语进行表达过程中所表现的语音、词汇、语法规范程度，是评定其所达到的水平等级的重要依据。 

报名条件:

        1. 中小学教师；

        2. 中等师范学校教师和高等院校文科教师；

        3. 师范院校毕业生（高等师范里，首先是文科类毕业生）；

        4. 广播、电视、电影、戏剧，以及外语、旅游等高等院校和中等职业学校相关专业的教师和毕业生；

        5. 各级广播电台、电视台的播音员、节目主持人；

        6. 从事电影、电视剧、话剧表演和影视配音的专业人员；

        7. 其他应当接受普通话水平测试的人员和自愿接受普通话水平测试的人员。

报考时间 各地时间不统一

###计算机二级

计算机二级考试包含：程序设计/办公软件高级应用，考核内容包括计算机语言与基础程序设计能力，要求参试者掌握一门计算机语言，可选类别有高级语言程序设计类、数据库程序设计类等；办公软件高级应用能力，要求参试者具有计算机应用知识及MS Office办公软件的高级应用能力，能够在实际办公环境中开展具体应用。 

考试时间 每年三月 九月 十二月 具体时间需参考报名时间

###教师资格证

1.考试类别:

　  中小学教师资格考试包括幼儿园教师资格考试、小学教师资格考试、初级中学教师资格考试、高级中学教师资格考试。

　　申请认定中等职业学校文化课教师资格、中等职业学校专业课和中等职业学校实习指导教师资格者参加高级中学教师资格考试。

　2.考试对象:

　  试点省份内所有申请幼儿园、小学、初级中学、高级中学、中等职业学校教师资格和中等职业学校实习指导教师资格的人员须参加中小学教师资格考试。

　　试点工作启动前已入学的全日制普通院校师范类专业学生，可以持毕业证书直接认定相应的教师资格。试点工作启动后入学的师范类专业学生，申请中小学和幼儿园教师资格应参加教师资格考试。

  3.报考条件:

        中华人民共和国公民；拥护中国共产党领导，拥护社会主义制度；无犯罪记录。

        原则上应具备《教师法》规定的相应学历条件，并应符合本省确定并公布的学历要求。

        应届在校生报考中小学教师资格考试应提供学校出具的在籍学习证明。



具体报考时间 报名方式可在网上查询。


`