export default `

**坞城校区**

山西大学2019级新生群: 564480135  

山西大学哲院社会学学院2019级迎新群: 979193018 

山西大学经济与管理学院2019级迎新群: 739209412

山西大学数学科学学院2019级新生群: 704022847

山西大学化学化工学院2019级迎新群: 291410520

山西大学生命科学学院2019级新生群: 311921375

山西大学体育学院2019级新生群: 251487167

山西大学政治与公共管理学院2019级新生群: 750840387

山西大学计算机与信息技术学院2019级新生群: 517215938

山西大学环境与资源学院2019级迎新群: 935751647

山西大学物理电子工程学院2019级迎新群: 971812368

山西大学历史文化学院2019级迎新群: 759121006

山西大学音乐学院2019级迎新群: 485074610

山西大学教育科学学院2019级迎新群: 815749474

山西大学法学院2019级迎新群: 669648192

山西大学初民学院2019迎新群:  362955182

山西大学新闻学院2019迎新群: 172427347  

山西大学环境工程系2019级迎新群: 929692187

山西大学外国语学院2019级迎新群: 761865140

山大戏文(艺术类) 2019级迎新群: 933871818

山西大学汉语言文学2019级新生群: 704649901  

山西大学文学院汉语国际教育2019新生群: 565518000




**大东关校区**

山西大学大东关2019级新生群: 281175265

山西大学软件学院2019级新生群: 153865593 

山西大学工程管理系2019级新生群: 866809141

山西大学自动化系2019级新生群: 849426122

山西大学动力工程系2019级迎新群: 751690960

山西大学土木工程系2019级迎新群: 687899670

山西大学电力工程系2019级迎新群: 497992010

山西大学电子信息工程系2019迎新群: 759409967


`